;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v7.4.6 *
;* Date/Time created: Thu Mar 06 16:37:25 2014                                *
;******************************************************************************
	.compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_precision_bits=32 --mem_model:code=near --mem_model:const=data --mem_model:data=far_aggregates --multithread --object_format=elf --silicon_version=6600 --symdebug:dwarf_version=3 --symdebug:skeletal 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C66xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far Aggregate Data                                   *
;*   Pipelining        : Enabled                                              *

	.dwattr $C$DW$408, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$408, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$464

	.dwattr $C$DW$T$464, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/csl_cache.h")
	.dwattr $C$DW$T$464, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$T$464, DW_AT_decl_column(0x0e)
$C$DW$T$465	.dwtag  DW_TAG_typedef, DW_AT_name("CACHE_L2Size")
	.dwattr $C$DW$T$465, DW_AT_type(*$C$DW$T$464)
	.dwattr $C$DW$T$465, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$465, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/csl_cache.h")
	.dwattr $C$DW$T$465, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$T$465, DW_AT_decl_column(0x03)

$C$DW$T$466	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$466, DW_AT_byte_size(0x04)
$C$DW$409	.dwtag  DW_TAG_enumerator, DW_AT_name("Cppi_ChType_RX_CHANNEL"), DW_AT_const_value(0x00)
	.dwattr $C$DW$409, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$409, DW_AT_decl_column(0x05)
$C$DW$410	.dwtag  DW_TAG_enumerator, DW_AT_name("Cppi_ChType_TX_CHANNEL"), DW_AT_const_value(0x01)
	.dwattr $C$DW$410, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$410, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$466

	.dwattr $C$DW$T$466, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$466, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$T$466, DW_AT_decl_column(0x01)
$C$DW$T$467	.dwtag  DW_TAG_typedef, DW_AT_name("Cppi_ChType")
	.dwattr $C$DW$T$467, DW_AT_type(*$C$DW$T$466)
	.dwattr $C$DW$T$467, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$467, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$467, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$T$467, DW_AT_decl_column(0x02)

$C$DW$T$468	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$468, DW_AT_byte_size(0x04)
$C$DW$411	.dwtag  DW_TAG_enumerator, DW_AT_name("Cppi_Wait_NO_WAIT"), DW_AT_const_value(0x00)
	.dwattr $C$DW$411, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$411, DW_AT_decl_column(0x05)
$C$DW$412	.dwtag  DW_TAG_enumerator, DW_AT_name("Cppi_Wait_WAIT"), DW_AT_const_value(0x01)
	.dwattr $C$DW$412, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$412, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$468

	.dwattr $C$DW$T$468, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$468, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$468, DW_AT_decl_column(0x01)
$C$DW$T$469	.dwtag  DW_TAG_typedef, DW_AT_name("Cppi_Wait")
	.dwattr $C$DW$T$469, DW_AT_type(*$C$DW$T$468)
	.dwattr $C$DW$T$469, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$469, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$469, DW_AT_decl_line(0xba)
	.dwattr $C$DW$T$469, DW_AT_decl_column(0x02)

$C$DW$T$470	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$470, DW_AT_byte_size(0x04)
$C$DW$413	.dwtag  DW_TAG_enumerator, DW_AT_name("Qmss_IntdInterruptType_HIGH"), DW_AT_const_value(0x00)
	.dwattr $C$DW$413, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x111)
	.dwattr $C$DW$413, DW_AT_decl_column(0x05)
$C$DW$414	.dwtag  DW_TAG_enumerator, DW_AT_name("Qmss_IntdInterruptType_LOW"), DW_AT_const_value(0x01)
	.dwattr $C$DW$414, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x115)
	.dwattr $C$DW$414, DW_AT_decl_column(0x05)
$C$DW$415	.dwtag  DW_TAG_enumerator, DW_AT_name("Qmss_IntdInterruptType_CDMA"), DW_AT_const_value(0x02)
	.dwattr $C$DW$415, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$415, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$470

	.dwattr $C$DW$T$470, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$470, DW_AT_decl_line(0x10d)
	.dwattr $C$DW$T$470, DW_AT_decl_column(0x01)
$C$DW$T$471	.dwtag  DW_TAG_typedef, DW_AT_name("Qmss_IntdInterruptType")
	.dwattr $C$DW$T$471, DW_AT_type(*$C$DW$T$470)
	.dwattr $C$DW$T$471, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$471, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$471, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$T$471, DW_AT_decl_column(0x02)

$C$DW$T$472	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$472, DW_AT_byte_size(0x04)
$C$DW$416	.dwtag  DW_TAG_enumerator, DW_AT_name("pa_MULTI_ROUTE_MODE_CONFIG"), DW_AT_const_value(0x00)
	.dwattr $C$DW$416, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/pa/pa.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0xb4e)
	.dwattr $C$DW$416, DW_AT_decl_column(0x03)
$C$DW$417	.dwtag  DW_TAG_enumerator, DW_AT_name("pa_MULTI_ROUTE_MODE_RESET"), DW_AT_const_value(0x01)
	.dwattr $C$DW$417, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/pa/pa.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0xb4f)
	.dwattr $C$DW$417, DW_AT_decl_column(0x03)
	.dwendtag $C$DW$T$472

	.dwattr $C$DW$T$472, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/pa/pa.h")
	.dwattr $C$DW$T$472, DW_AT_decl_line(0xb4d)
	.dwattr $C$DW$T$472, DW_AT_decl_column(0x0e)
$C$DW$T$473	.dwtag  DW_TAG_typedef, DW_AT_name("paMultiRouteModes_e")
	.dwattr $C$DW$T$473, DW_AT_type(*$C$DW$T$472)
	.dwattr $C$DW$T$473, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$473, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/pa/pa.h")
	.dwattr $C$DW$T$473, DW_AT_decl_line(0xb50)
	.dwattr $C$DW$T$473, DW_AT_decl_column(0x03)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x20)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$418, DW_AT_name("REVISION_REG")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("REVISION_REG")
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_global_config.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x33)
	.dwattr $C$DW$418, DW_AT_decl_column(0x15)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$419, DW_AT_name("PERF_CONTROL_REG")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("PERF_CONTROL_REG")
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_global_config.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x34)
	.dwattr $C$DW$419, DW_AT_decl_column(0x15)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$420, DW_AT_name("EMULATION_CONTROL_REG")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("EMULATION_CONTROL_REG")
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_global_config.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x35)
	.dwattr $C$DW$420, DW_AT_decl_column(0x15)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$421, DW_AT_name("PRIORITY_CONTROL_REG")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("PRIORITY_CONTROL_REG")
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_global_config.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x36)
	.dwattr $C$DW$421, DW_AT_decl_column(0x15)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$422, DW_AT_name("QM_BASE_ADDRESS_REG")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("QM_BASE_ADDRESS_REG")
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_global_config.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x37)
	.dwattr $C$DW$422, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$25

	.dwattr $C$DW$T$25, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_global_config.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x11)
$C$DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_global_configRegs")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$49, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_global_config.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
$C$DW$T$50	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$50, DW_AT_address_class(0x20)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x20)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$423, DW_AT_name("TX_CHANNEL_GLOBAL_CONFIG_REG_A")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("TX_CHANNEL_GLOBAL_CONFIG_REG_A")
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x33)
	.dwattr $C$DW$423, DW_AT_decl_column(0x15)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$424, DW_AT_name("TX_CHANNEL_GLOBAL_CONFIG_REG_B")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("TX_CHANNEL_GLOBAL_CONFIG_REG_B")
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0x34)
	.dwattr $C$DW$424, DW_AT_decl_column(0x15)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$425, DW_AT_name("RSVD0")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0x35)
	.dwattr $C$DW$425, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x11)
$C$DW$T$33	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_tx_channel_configTx_channel_global_configRegs")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$33, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x03)

$C$DW$T$34	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x1020)
$C$DW$426	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$426, DW_AT_upper_bound(0x80)
	.dwendtag $C$DW$T$34


$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x1020)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$427, DW_AT_name("TX_CHANNEL_GLOBAL_CONFIG")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("TX_CHANNEL_GLOBAL_CONFIG")
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$427, DW_AT_decl_column(0x3f)
	.dwendtag $C$DW$T$35

	.dwattr $C$DW$T$35, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x11)
$C$DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_tx_channel_configRegs")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_channel_config.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
$C$DW$T$52	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x20)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$428, DW_AT_name("RX_CHANNEL_GLOBAL_CONFIG_REG")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("RX_CHANNEL_GLOBAL_CONFIG_REG")
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_channel_config.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0x33)
	.dwattr $C$DW$428, DW_AT_decl_column(0x15)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$429, DW_AT_name("RSVD0")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_channel_config.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0x34)
	.dwattr $C$DW$429, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$37

	.dwattr $C$DW$T$37, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_channel_config.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x11)
$C$DW$T$38	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_rx_channel_configRx_channel_global_configRegs")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_channel_config.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x03)

$C$DW$T$39	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x1020)
$C$DW$430	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$430, DW_AT_upper_bound(0x80)
	.dwendtag $C$DW$T$39


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x1020)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$431, DW_AT_name("RX_CHANNEL_GLOBAL_CONFIG")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("RX_CHANNEL_GLOBAL_CONFIG")
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_channel_config.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$431, DW_AT_decl_column(0x3f)
	.dwendtag $C$DW$T$40

	.dwattr $C$DW$T$40, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_channel_config.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x11)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_rx_channel_configRegs")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$53, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_channel_config.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
$C$DW$T$54	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x20)

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x204)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$432, DW_AT_name("TX_CHANNEL_SCHEDULER_CONFIG_REG")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("TX_CHANNEL_SCHEDULER_CONFIG_REG")
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_scheduler_config.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0x33)
	.dwattr $C$DW$432, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$42

	.dwattr $C$DW$T$42, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_scheduler_config.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x11)
$C$DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_tx_scheduler_configRegs")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$55, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_tx_scheduler_config.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
$C$DW$T$56	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$56, DW_AT_address_class(0x20)

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x20)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$433, DW_AT_name("RX_FLOW_CONFIG_REG_A")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_A")
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0x33)
	.dwattr $C$DW$433, DW_AT_decl_column(0x15)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$434, DW_AT_name("RX_FLOW_CONFIG_REG_B")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_B")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0x34)
	.dwattr $C$DW$434, DW_AT_decl_column(0x15)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$435, DW_AT_name("RX_FLOW_CONFIG_REG_C")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_C")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0x35)
	.dwattr $C$DW$435, DW_AT_decl_column(0x15)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$436, DW_AT_name("RX_FLOW_CONFIG_REG_D")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_D")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0x36)
	.dwattr $C$DW$436, DW_AT_decl_column(0x15)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$437, DW_AT_name("RX_FLOW_CONFIG_REG_E")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_E")
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0x37)
	.dwattr $C$DW$437, DW_AT_decl_column(0x15)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$438, DW_AT_name("RX_FLOW_CONFIG_REG_F")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_F")
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0x38)
	.dwattr $C$DW$438, DW_AT_decl_column(0x15)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$439, DW_AT_name("RX_FLOW_CONFIG_REG_G")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_G")
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0x39)
	.dwattr $C$DW$439, DW_AT_decl_column(0x15)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$440, DW_AT_name("RX_FLOW_CONFIG_REG_H")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("RX_FLOW_CONFIG_REG_H")
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$440, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$43

	.dwattr $C$DW$T$43, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x11)
$C$DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_rx_flow_configRx_flow_configRegs")
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$44, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x03)

$C$DW$T$45	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x1020)
$C$DW$441	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$441, DW_AT_upper_bound(0x80)
	.dwendtag $C$DW$T$45


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x1020)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$442, DW_AT_name("RX_FLOW_CONFIG")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("RX_FLOW_CONFIG")
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0x41)
	.dwattr $C$DW$442, DW_AT_decl_column(0x32)
	.dwendtag $C$DW$T$46

	.dwattr $C$DW$T$46, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x11)
$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cppidma_rx_flow_configRegs")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$57, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cppidma_rx_flow_config.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
$C$DW$T$58	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_address_class(0x20)

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x28)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$443, DW_AT_name("dmaNum")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("dmaNum")
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$443, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$443, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$443, DW_AT_decl_column(0x15)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$444, DW_AT_name("maxRxCh")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("maxRxCh")
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$444, DW_AT_decl_column(0x17)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$445, DW_AT_name("maxTxCh")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("maxTxCh")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$445, DW_AT_decl_column(0x17)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$446, DW_AT_name("maxRxFlow")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("maxRxFlow")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$446, DW_AT_decl_column(0x17)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$447, DW_AT_name("rxPriority")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("rxPriority")
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$447, DW_AT_decl_column(0x17)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$448, DW_AT_name("txPriority")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("txPriority")
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$448, DW_AT_decl_column(0x17)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$449, DW_AT_name("gblCfgRegs")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("gblCfgRegs")
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$449, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$449, DW_AT_decl_line(0xda)
	.dwattr $C$DW$449, DW_AT_decl_column(0x2a)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$450, DW_AT_name("txChRegs")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("txChRegs")
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$450, DW_AT_decl_column(0x2a)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$451, DW_AT_name("rxChRegs")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("rxChRegs")
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0xde)
	.dwattr $C$DW$451, DW_AT_decl_column(0x2a)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$452, DW_AT_name("txSchedRegs")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("txSchedRegs")
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$452, DW_AT_decl_column(0x2a)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$453, DW_AT_name("rxFlowRegs")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("rxFlowRegs")
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$453, DW_AT_decl_column(0x2a)
	.dwendtag $C$DW$T$59

	.dwattr $C$DW$T$59, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
$C$DW$T$476	.dwtag  DW_TAG_typedef, DW_AT_name("Cppi_GlobalConfigParams")
	.dwattr $C$DW$T$476, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$476, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$476, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$476, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$476, DW_AT_decl_column(0x02)
$C$DW$T$477	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$477, DW_AT_type(*$C$DW$T$476)
	.dwattr $C$DW$T$477, DW_AT_address_class(0x20)

$C$DW$T$478	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$478, DW_AT_type(*$C$DW$T$476)
	.dwattr $C$DW$T$478, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$478, DW_AT_byte_size(0x78)
$C$DW$454	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$454, DW_AT_upper_bound(0x02)
	.dwendtag $C$DW$T$478


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x18)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$455, DW_AT_name("dmaNum")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("dmaNum")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0x108)
	.dwattr $C$DW$455, DW_AT_decl_column(0x21)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$456, DW_AT_name("writeFifoDepth")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("writeFifoDepth")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x113)
	.dwattr $C$DW$456, DW_AT_decl_column(0x21)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$457, DW_AT_name("timeoutCount")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("timeoutCount")
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$457, DW_AT_decl_column(0x21)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$458, DW_AT_name("qm0BaseAddress")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("qm0BaseAddress")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0x123)
	.dwattr $C$DW$458, DW_AT_decl_column(0x22)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$459, DW_AT_name("qm1BaseAddress")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("qm1BaseAddress")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0x125)
	.dwattr $C$DW$459, DW_AT_decl_column(0x22)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$460, DW_AT_name("qm2BaseAddress")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("qm2BaseAddress")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0x127)
	.dwattr $C$DW$460, DW_AT_decl_column(0x22)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$461, DW_AT_name("qm3BaseAddress")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("qm3BaseAddress")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0x129)
	.dwattr $C$DW$461, DW_AT_decl_column(0x22)
	.dwendtag $C$DW$T$62

	.dwattr $C$DW$T$62, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
$C$DW$T$480	.dwtag  DW_TAG_typedef, DW_AT_name("Cppi_CpDmaInitCfg")
	.dwattr $C$DW$T$480, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$480, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$480, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$480, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$480, DW_AT_decl_column(0x02)
$C$DW$T$481	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$481, DW_AT_type(*$C$DW$T$480)
	.dwattr $C$DW$T$481, DW_AT_address_class(0x20)

$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x10)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$462, DW_AT_name("channelNum")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("channelNum")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0x134)
	.dwattr $C$DW$462, DW_AT_decl_column(0x17)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$463, DW_AT_name("txEnable")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("txEnable")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0x136)
	.dwattr $C$DW$463, DW_AT_decl_column(0x15)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$464, DW_AT_name("priority")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("priority")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0x138)
	.dwattr $C$DW$464, DW_AT_decl_column(0x17)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$465, DW_AT_name("filterEPIB")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("filterEPIB")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$465, DW_AT_decl_column(0x1a)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$466, DW_AT_name("filterPS")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("filterPS")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0x144)
	.dwattr $C$DW$466, DW_AT_decl_column(0x1a)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$467, DW_AT_name("aifMonoMode")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("aifMonoMode")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$467, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$66

	.dwattr $C$DW$T$66, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
$C$DW$T$483	.dwtag  DW_TAG_typedef, DW_AT_name("Cppi_TxChInitCfg")
	.dwattr $C$DW$T$483, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$483, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$483, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$483, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$T$483, DW_AT_decl_column(0x02)
$C$DW$T$484	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$484, DW_AT_type(*$C$DW$T$483)
	.dwattr $C$DW$T$484, DW_AT_address_class(0x20)

$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x08)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$468, DW_AT_name("channelNum")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("channelNum")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0x157)
	.dwattr $C$DW$468, DW_AT_decl_column(0x17)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$469, DW_AT_name("rxEnable")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("rxEnable")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0x159)
	.dwattr $C$DW$469, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$67

	.dwattr $C$DW$T$67, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x153)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
$C$DW$T$486	.dwtag  DW_TAG_typedef, DW_AT_name("Cppi_RxChInitCfg")
	.dwattr $C$DW$T$486, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$486, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$486, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/cppi/cppi_drv.h")
	.dwattr $C$DW$T$486, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$T$486, DW_AT_decl_column(0x02)
$C$DW$T$487	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$487, DW_AT_type(*$C$DW$T$486)
	.dwattr $C$DW$T$487, DW_AT_address_class(0x20)

$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x0c)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$470, DW_AT_name("pdspId")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("pdspId")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0x191)
	.dwattr $C$DW$470, DW_AT_decl_column(0x15)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$471, DW_AT_name("firmware")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("firmware")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0x194)
	.dwattr $C$DW$471, DW_AT_decl_column(0x16)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$472, DW_AT_name("size")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("size")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0x196)
	.dwattr $C$DW$472, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$70

	.dwattr $C$DW$T$70, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x01)
$C$DW$T$71	.dwtag  DW_TAG_typedef, DW_AT_name("Qmss_PdspCfg")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$71, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x197)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x02)

$C$DW$T$72	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x18)
$C$DW$473	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$473, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$72


$C$DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$73, DW_AT_byte_size(0x2c)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$474, DW_AT_name("linkingRAM0Base")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("linkingRAM0Base")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0x1a0)
	.dwattr $C$DW$474, DW_AT_decl_column(0x17)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$475, DW_AT_name("linkingRAM0Size")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("linkingRAM0Size")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$475, DW_AT_decl_column(0x17)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$476, DW_AT_name("linkingRAM1Base")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("linkingRAM1Base")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$476, DW_AT_decl_column(0x17)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$477, DW_AT_name("maxDescNum")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("maxDescNum")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$477, DW_AT_decl_column(0x17)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$478, DW_AT_name("pdspFirmware")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("pdspFirmware")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0x1ac)
	.dwattr $C$DW$478, DW_AT_decl_column(0x15)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$479, DW_AT_name("qmssHwStatus")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("qmssHwStatus")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$479, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$73

	.dwattr $C$DW$T$73, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x19d)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x01)
$C$DW$T$256	.dwtag  DW_TAG_typedef, DW_AT_name("Qmss_InitCfg")
	.dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$256, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$256, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$256, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$T$256, DW_AT_decl_column(0x02)
$C$DW$T$489	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$489, DW_AT_type(*$C$DW$T$256)
	.dwattr $C$DW$T$489, DW_AT_address_class(0x20)

$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x08)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$480, DW_AT_name("startIndex")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("startIndex")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0x144)
	.dwattr $C$DW$480, DW_AT_decl_column(0x11)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$481, DW_AT_name("maxNum")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("maxNum")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x146)
	.dwattr $C$DW$481, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$74

	.dwattr $C$DW$T$74, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x142)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
$C$DW$T$104	.dwtag  DW_TAG_typedef, DW_AT_name("Qmss_QueueNumRange")
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$104, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$T$104, DW_AT_decl_line(0x147)
	.dwattr $C$DW$T$104, DW_AT_decl_column(0x02)

$C$DW$T$105	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$105, DW_AT_byte_size(0xc8)
$C$DW$482	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$482, DW_AT_upper_bound(0x18)
	.dwendtag $C$DW$T$105


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x60)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$483, DW_AT_name("REVISION_REG")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("REVISION_REG")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$483, DW_AT_decl_column(0x15)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$484, DW_AT_name("RSVD0")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$484, DW_AT_decl_column(0x14)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$485, DW_AT_name("QUEUE_DIVERSION_REG")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("QUEUE_DIVERSION_REG")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$485, DW_AT_decl_column(0x15)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$486, DW_AT_name("LINKING_RAM_REGION_0_BASE_ADDRESS_REG")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("LINKING_RAM_REGION_0_BASE_ADDRESS_REG")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x40)
	.dwattr $C$DW$486, DW_AT_decl_column(0x15)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$487, DW_AT_name("LINKING_RAM_REGION_0_SIZE_REG")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("LINKING_RAM_REGION_0_SIZE_REG")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x41)
	.dwattr $C$DW$487, DW_AT_decl_column(0x15)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$488, DW_AT_name("LINKING_RAM_REGION_1_BASE_ADDRESS_REG")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("LINKING_RAM_REGION_1_BASE_ADDRESS_REG")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x42)
	.dwattr $C$DW$488, DW_AT_decl_column(0x15)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$489, DW_AT_name("RSVD1")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0x43)
	.dwattr $C$DW$489, DW_AT_decl_column(0x14)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$490, DW_AT_name("FREE_DESCRIPTOR_STARVE_COUNT_REG")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("FREE_DESCRIPTOR_STARVE_COUNT_REG")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0x44)
	.dwattr $C$DW$490, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$78

	.dwattr $C$DW$T$78, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x11)
$C$DW$T$106	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_configRegs")
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$106, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_config.h")
	.dwattr $C$DW$T$106, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$106, DW_AT_decl_column(0x03)
$C$DW$T$107	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$107, DW_AT_address_class(0x20)

$C$DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$79, DW_AT_byte_size(0x10)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$491, DW_AT_name("MEMORY_REGION_BASE_ADDRESS_REG")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("MEMORY_REGION_BASE_ADDRESS_REG")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0x33)
	.dwattr $C$DW$491, DW_AT_decl_column(0x15)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$492, DW_AT_name("MEMORY_REGION_START_INDEX_REG")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("MEMORY_REGION_START_INDEX_REG")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0x34)
	.dwattr $C$DW$492, DW_AT_decl_column(0x15)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$493, DW_AT_name("MEMORY_REGION_DESCRIPTOR_SETUP_REG")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("MEMORY_REGION_DESCRIPTOR_SETUP_REG")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0x35)
	.dwattr $C$DW$493, DW_AT_decl_column(0x15)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$494, DW_AT_name("RSVD0")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0x36)
	.dwattr $C$DW$494, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$79

	.dwattr $C$DW$T$79, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x11)
$C$DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_descriptor_region_configMemory_region_base_address_groupRegs")
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$80, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$T$80, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$80, DW_AT_decl_column(0x03)

$C$DW$T$81	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$81, DW_AT_byte_size(0x140)
$C$DW$495	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$495, DW_AT_upper_bound(0x13)
	.dwendtag $C$DW$T$81


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x140)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$496, DW_AT_name("MEMORY_REGION_BASE_ADDRESS_GROUP")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("MEMORY_REGION_BASE_ADDRESS_GROUP")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$496, DW_AT_decl_column(0x49)
	.dwendtag $C$DW$T$82

	.dwattr $C$DW$T$82, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x11)
$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_descriptor_region_configRegs")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$108, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_descriptor_region_config.h")
	.dwattr $C$DW$T$108, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$108, DW_AT_decl_column(0x03)
$C$DW$T$109	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$109, DW_AT_address_class(0x20)

$C$DW$T$83	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$83, DW_AT_byte_size(0x10)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$497, DW_AT_name("QUEUE_REG_A")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("QUEUE_REG_A")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0x33)
	.dwattr $C$DW$497, DW_AT_decl_column(0x15)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$498, DW_AT_name("QUEUE_REG_B")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("QUEUE_REG_B")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0x34)
	.dwattr $C$DW$498, DW_AT_decl_column(0x15)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$499, DW_AT_name("QUEUE_REG_C")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("QUEUE_REG_C")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0x35)
	.dwattr $C$DW$499, DW_AT_decl_column(0x15)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$500, DW_AT_name("QUEUE_REG_D")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("QUEUE_REG_D")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0x36)
	.dwattr $C$DW$500, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$83

	.dwattr $C$DW$T$83, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x11)
$C$DW$T$84	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_queue_managementQueue_mgmt_groupRegs")
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$84, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$T$84, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$84, DW_AT_decl_column(0x03)

$C$DW$T$85	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x20000)
$C$DW$501	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$501, DW_AT_upper_bound(0x1fff)
	.dwendtag $C$DW$T$85


$C$DW$T$86	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$86, DW_AT_byte_size(0x20000)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$502, DW_AT_name("QUEUE_MGMT_GROUP")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("QUEUE_MGMT_GROUP")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$502, DW_AT_decl_column(0x31)
	.dwendtag $C$DW$T$86

	.dwattr $C$DW$T$86, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x11)
$C$DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_queue_managementRegs")
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$110, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_management.h")
	.dwattr $C$DW$T$110, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$110, DW_AT_decl_column(0x03)
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x20)

$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x10)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$503, DW_AT_name("QUEUE_STATUS_CONFIG_REG_A")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("QUEUE_STATUS_CONFIG_REG_A")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0x33)
	.dwattr $C$DW$503, DW_AT_decl_column(0x15)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$504, DW_AT_name("QUEUE_STATUS_CONFIG_REG_B")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("QUEUE_STATUS_CONFIG_REG_B")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0x34)
	.dwattr $C$DW$504, DW_AT_decl_column(0x15)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$505, DW_AT_name("QUEUE_STATUS_CONFIG_REG_C")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("QUEUE_STATUS_CONFIG_REG_C")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0x35)
	.dwattr $C$DW$505, DW_AT_decl_column(0x15)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$506, DW_AT_name("QUEUE_STATUS_CONFIG_REG_D")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("QUEUE_STATUS_CONFIG_REG_D")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0x36)
	.dwattr $C$DW$506, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$87

	.dwattr $C$DW$T$87, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x11)
$C$DW$T$88	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_queue_status_configQueue_status_config_groupRegs")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$88, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x03)

$C$DW$T$89	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x20000)
$C$DW$507	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$507, DW_AT_upper_bound(0x1fff)
	.dwendtag $C$DW$T$89


$C$DW$T$90	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$90, DW_AT_byte_size(0x20000)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$508, DW_AT_name("QUEUE_STATUS_CONFIG_GROUP")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("QUEUE_STATUS_CONFIG_GROUP")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$508, DW_AT_decl_column(0x3d)
	.dwendtag $C$DW$T$90

	.dwattr $C$DW$T$90, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$T$90, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$90, DW_AT_decl_column(0x11)
$C$DW$T$112	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_queue_status_configRegs")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$90)
	.dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$112, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_queue_status_config.h")
	.dwattr $C$DW$T$112, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$112, DW_AT_decl_column(0x03)
$C$DW$T$113	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
	.dwattr $C$DW$T$113, DW_AT_address_class(0x20)

$C$DW$T$96	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$96, DW_AT_byte_size(0x484)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$509, DW_AT_name("REVISION_REG")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("REVISION_REG")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0x33)
	.dwattr $C$DW$509, DW_AT_decl_column(0x15)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$510, DW_AT_name("RSVD0")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x34)
	.dwattr $C$DW$510, DW_AT_decl_column(0x14)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$511, DW_AT_name("EOI_REG")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("EOI_REG")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x35)
	.dwattr $C$DW$511, DW_AT_decl_column(0x15)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$512, DW_AT_name("INTR_VECTOR_REG")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("INTR_VECTOR_REG")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x36)
	.dwattr $C$DW$512, DW_AT_decl_column(0x15)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$92)
	.dwattr $C$DW$513, DW_AT_name("RSVD1")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("RSVD1")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x37)
	.dwattr $C$DW$513, DW_AT_decl_column(0x14)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$514, DW_AT_name("STATUS_REG0")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("STATUS_REG0")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x38)
	.dwattr $C$DW$514, DW_AT_decl_column(0x15)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$515, DW_AT_name("STATUS_REG1")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("STATUS_REG1")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x39)
	.dwattr $C$DW$515, DW_AT_decl_column(0x15)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$516, DW_AT_name("STATUS_REG2")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("STATUS_REG2")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$516, DW_AT_decl_column(0x15)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$517, DW_AT_name("STATUS_REG3")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("STATUS_REG3")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$517, DW_AT_decl_column(0x15)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$518, DW_AT_name("STATUS_REG4")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("STATUS_REG4")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x210]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$518, DW_AT_decl_column(0x15)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$519, DW_AT_name("RSVD2")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("RSVD2")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x214]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$519, DW_AT_decl_column(0x14)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$520, DW_AT_name("STATUS_CLR_REG0")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("STATUS_CLR_REG0")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x280]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$520, DW_AT_decl_column(0x15)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$521, DW_AT_name("STATUS_CLR_REG1")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("STATUS_CLR_REG1")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x284]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$521, DW_AT_decl_column(0x15)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$522, DW_AT_name("RSVD3")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("RSVD3")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x288]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x40)
	.dwattr $C$DW$522, DW_AT_decl_column(0x14)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$523, DW_AT_name("STATUS_CLR_REG4")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("STATUS_CLR_REG4")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x290]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x41)
	.dwattr $C$DW$523, DW_AT_decl_column(0x15)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$524, DW_AT_name("RSVD4")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("RSVD4")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x294]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x42)
	.dwattr $C$DW$524, DW_AT_decl_column(0x14)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$525, DW_AT_name("INTCNT_REG")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("INTCNT_REG")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x43)
	.dwattr $C$DW$525, DW_AT_decl_column(0x15)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$526, DW_AT_name("RSVD5")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("RSVD5")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c8]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x44)
	.dwattr $C$DW$526, DW_AT_decl_column(0x14)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$527, DW_AT_name("INTR_VECTOR_REG_HOST")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("INTR_VECTOR_REG_HOST")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x480]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x45)
	.dwattr $C$DW$527, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$96

	.dwattr $C$DW$T$96, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$T$96, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$96, DW_AT_decl_column(0x11)
$C$DW$T$114	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Qm_intdRegs")
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$114, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_qm_intd.h")
	.dwattr $C$DW$T$114, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$114, DW_AT_decl_column(0x03)
$C$DW$T$115	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_address_class(0x20)

$C$DW$T$97	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$97, DW_AT_byte_size(0x30)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$528, DW_AT_name("PDSP_CONTROL_REG")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("PDSP_CONTROL_REG")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x33)
	.dwattr $C$DW$528, DW_AT_decl_column(0x15)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$529, DW_AT_name("PDSP_STATUS_REG")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("PDSP_STATUS_REG")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x34)
	.dwattr $C$DW$529, DW_AT_decl_column(0x15)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$530, DW_AT_name("PDSP_WAKEUP_ENABLE_REG")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("PDSP_WAKEUP_ENABLE_REG")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x35)
	.dwattr $C$DW$530, DW_AT_decl_column(0x15)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$531, DW_AT_name("PDSP_CYCLE_COUNT_REG")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("PDSP_CYCLE_COUNT_REG")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x36)
	.dwattr $C$DW$531, DW_AT_decl_column(0x15)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$532, DW_AT_name("PDSP_STALL_COUNT_REG")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("PDSP_STALL_COUNT_REG")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x37)
	.dwattr $C$DW$532, DW_AT_decl_column(0x15)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$533, DW_AT_name("RSVD0")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x38)
	.dwattr $C$DW$533, DW_AT_decl_column(0x14)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$534, DW_AT_name("PDSP_CONSTANT_TABLE_BLOCK_INDEX_REG_0")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("PDSP_CONSTANT_TABLE_BLOCK_INDEX_REG_0")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x39)
	.dwattr $C$DW$534, DW_AT_decl_column(0x15)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$535, DW_AT_name("PDSP_CONSTANT_TABLE_BLOCK_INDEX_REG_1")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("PDSP_CONSTANT_TABLE_BLOCK_INDEX_REG_1")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$535, DW_AT_decl_column(0x15)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$536, DW_AT_name("PDSP_CONSTANT_TABLE_PROG_PTR_REG_0")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("PDSP_CONSTANT_TABLE_PROG_PTR_REG_0")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$536, DW_AT_decl_column(0x15)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$537, DW_AT_name("PDSP_CONSTANT_TABLE_PROG_PTR_REG_1")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("PDSP_CONSTANT_TABLE_PROG_PTR_REG_1")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$537, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$97

	.dwattr $C$DW$T$97, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$T$97, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$97, DW_AT_decl_column(0x11)
$C$DW$T$118	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_PdspRegs")
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$118, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_pdsp.h")
	.dwattr $C$DW$T$118, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$118, DW_AT_decl_column(0x03)
$C$DW$T$119	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$119, DW_AT_address_class(0x20)

$C$DW$T$120	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$120, DW_AT_byte_size(0x08)
$C$DW$538	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$538, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$120


$C$DW$T$99	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$99, DW_AT_byte_size(0x40)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$539, DW_AT_name("SRC_ADDR_REG")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("SRC_ADDR_REG")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x33)
	.dwattr $C$DW$539, DW_AT_decl_column(0x15)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$540, DW_AT_name("DST_ADDR_REG")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("DST_ADDR_REG")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x34)
	.dwattr $C$DW$540, DW_AT_decl_column(0x15)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$541, DW_AT_name("XFER_CTRL_REG")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("XFER_CTRL_REG")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x35)
	.dwattr $C$DW$541, DW_AT_decl_column(0x15)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$542, DW_AT_name("RSVD0")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("RSVD0")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x36)
	.dwattr $C$DW$542, DW_AT_decl_column(0x14)
	.dwendtag $C$DW$T$99

	.dwattr $C$DW$T$99, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x11)
$C$DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McdmaMcdma_channel_config_groupRegs")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x03)

$C$DW$T$101	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$101, DW_AT_byte_size(0x100)
$C$DW$543	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$543, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$101


$C$DW$T$102	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$102, DW_AT_byte_size(0x100)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$101)
	.dwattr $C$DW$544, DW_AT_name("MCDMA_CHANNEL_CONFIG_GROUP")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("MCDMA_CHANNEL_CONFIG_GROUP")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$544, DW_AT_decl_column(0x2d)
	.dwendtag $C$DW$T$102

	.dwattr $C$DW$T$102, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$T$102, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$102, DW_AT_decl_column(0x11)
$C$DW$T$123	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_McdmaRegs")
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$102)
	.dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$123, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_mcdma.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x03)
$C$DW$T$124	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
	.dwattr $C$DW$T$124, DW_AT_address_class(0x20)

$C$DW$T$103	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$103, DW_AT_byte_size(0x10)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$545, DW_AT_name("TIMER_CNTRL_REG")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("TIMER_CNTRL_REG")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cp_timer16.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x33)
	.dwattr $C$DW$545, DW_AT_decl_column(0x15)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$546, DW_AT_name("TIMER_LOAD_REG")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("TIMER_LOAD_REG")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cp_timer16.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x34)
	.dwattr $C$DW$546, DW_AT_decl_column(0x15)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$547, DW_AT_name("TIMER_VALUE_REG")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("TIMER_VALUE_REG")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cp_timer16.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x35)
	.dwattr $C$DW$547, DW_AT_decl_column(0x15)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$548, DW_AT_name("TIMER_IRQ_REG")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("TIMER_IRQ_REG")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cp_timer16.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0x36)
	.dwattr $C$DW$548, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$103

	.dwattr $C$DW$T$103, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cp_timer16.h")
	.dwattr $C$DW$T$103, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$103, DW_AT_decl_column(0x11)
$C$DW$T$125	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Cp_timer16Regs")
	.dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$103)
	.dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$125, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/csl/cslr_cp_timer16.h")
	.dwattr $C$DW$T$125, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$125, DW_AT_decl_column(0x03)
$C$DW$T$126	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
	.dwattr $C$DW$T$126, DW_AT_address_class(0x20)

$C$DW$T$127	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
	.dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$127, DW_AT_byte_size(0x08)
$C$DW$549	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$549, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$127


$C$DW$T$129	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$129, DW_AT_byte_size(0x120)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$550, DW_AT_name("maxQueMgr")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("maxQueMgr")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$550, DW_AT_decl_column(0x2d)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$551, DW_AT_name("maxQue")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("maxQue")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$551, DW_AT_decl_column(0x2d)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$105)
	.dwattr $C$DW$552, DW_AT_name("maxQueueNum")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("maxQueueNum")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x1be)
	.dwattr $C$DW$552, DW_AT_decl_column(0x2d)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$553, DW_AT_name("qmConfigReg")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("qmConfigReg")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x1c3)
	.dwattr $C$DW$553, DW_AT_decl_column(0x2e)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$554, DW_AT_name("qmDescReg")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("qmDescReg")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$554, DW_AT_decl_column(0x2e)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$555, DW_AT_name("qmQueMgmtReg")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("qmQueMgmtReg")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x1c7)
	.dwattr $C$DW$555, DW_AT_decl_column(0x2e)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$556, DW_AT_name("qmQueMgmtProxyReg")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("qmQueMgmtProxyReg")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$556, DW_AT_decl_column(0x2e)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$113)
	.dwattr $C$DW$557, DW_AT_name("qmQueStatReg")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("qmQueStatReg")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$557, DW_AT_decl_column(0x2e)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$558, DW_AT_name("qmQueIntdReg")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("qmQueIntdReg")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x1cd)
	.dwattr $C$DW$558, DW_AT_decl_column(0x2e)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$559, DW_AT_name("qmPdspCmdReg")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("qmPdspCmdReg")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x1cf)
	.dwattr $C$DW$559, DW_AT_decl_column(0x2e)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$560, DW_AT_name("qmPdspCtrlReg")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("qmPdspCtrlReg")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x1d1)
	.dwattr $C$DW$560, DW_AT_decl_column(0x2e)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$117)
	.dwattr $C$DW$561, DW_AT_name("qmPdspIRamReg")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("qmPdspIRamReg")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x1d3)
	.dwattr $C$DW$561, DW_AT_decl_column(0x2e)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$122)
	.dwattr $C$DW$562, DW_AT_name("qmStatusRAM")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("qmStatusRAM")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$562, DW_AT_decl_column(0x2e)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$116)
	.dwattr $C$DW$563, DW_AT_name("qmLinkingRAMReg")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("qmLinkingRAMReg")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x1d7)
	.dwattr $C$DW$563, DW_AT_decl_column(0x2e)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$124)
	.dwattr $C$DW$564, DW_AT_name("qmMcDMAReg")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("qmMcDMAReg")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$564, DW_AT_decl_column(0x2e)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$127)
	.dwattr $C$DW$565, DW_AT_name("qmTimer16Reg")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("qmTimer16Reg")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$565, DW_AT_decl_column(0x2e)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$566, DW_AT_name("qmQueMgmtDataReg")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("qmQueMgmtDataReg")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x1dd)
	.dwattr $C$DW$566, DW_AT_decl_column(0x2e)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$567, DW_AT_name("qmQueMgmtProxyDataReg")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("qmQueMgmtProxyDataReg")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("F:/ti/pdk_C6678_1_1_2_6/packages/ti/drv/qmss/qmss_qm.h")
